#include<iostream>
using namespace std;
void init(){
cout<<"                   _ooOoo_"<<endl;
cout<<"                  o8888888o"<<endl;
cout<<"                  88\" . \"88"<<endl;
cout<<"                  (| -_- |)"<<endl;
cout<<"                  O\\  =  /O"<<endl;
cout<<"               ____/\`---'\\____"<<endl;
cout<<"             .'  \\\\|  %  |//  `."<<endl;
cout<<"            /  \\\\|||  %  |||//  \\"<<endl;
cout<<"           /  _||||| -%- |||||-  \\"<<endl;
cout<<"           |   | \\\\\\  -  /// |   |"<<endl;
cout<<"           | \\_|  \'\'\\---/''  |   |"<<endl;
cout<<"           \\  .-\\__  `-`  ___/-. /"<<endl;
cout<<"         ___`. .'  /--.--\\  `. . __"<<endl;
cout<<"      .\"\" \'<  \`.___\\_<|>_/___.\'  >\'\"\"."<<endl;
cout<<"     | | :  \`- \\\`.;\`\\ _ /\`;.\`/ - \` : | |"<<endl;
cout<<"     \\  \\ \`-.   \\_ __\\ /__ _/   .-\` /  /"<<endl;
cout<<"======\`-.____\`-.___\\_____/___.-\`____.-\'======"<<endl;
cout<<"                   \`=---=\'"<<endl;
cout<<"^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^"<<endl;
cout<<"        佛祖保佑 永不宕机 永无BUG"<<endl;/**/ 
cout << endl;
cout<<"     佛曰:                       " << endl;/**/
cout << endl;
cout << "       写字楼里写字间，写字间里程序员；" << endl;/**/
cout << "       程序人员写程序，又拿程序换酒钱。" << endl;/**/
cout << "       酒醒只在网上坐，酒醉还来网下眠；" << endl;/**/
cout << "       酒醉酒醒日复日，网上网下年复年。" << endl;/**/
cout << "       但愿老死电脑间，不愿鞠躬老板前；" << endl;/**/
cout << "       奔驰宝马贵者趣，公交自行程序员。 " << endl;/**/
cout << "       别人笑我忒疯癫，我笑自己命太贱；" << endl;/**/
cout << "       不见满街漂亮妹，哪个归得程序员？" << endl;/**/
}
